In [1]:
# Ambientando Alô mundo!
print("Alô mundo")

Alô mundo

## SqlAlchemy é uma biblioteca de ORM

- Conexão fácil.
- Mapeamento de tabela com classe (ORM).
- Resolve um conflito de tecnologias com paradigmas diferentes.
- Tudo fique orientado a ojetos.

In [2]:
! pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\ead\desktop\luiz\projeto_final_manha\.venv\lib\site-packages (2.0.31)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\ead\desktop\luiz\projeto_final_manha\.venv\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\ead\desktop\luiz\projeto_final_manha\.venv\lib\site-packages (from sqlalchemy) (3.0.3)

In [3]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\ead\desktop\luiz\projeto_final_manha\.venv\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ead\desktop\luiz\projeto_final_manha\.venv\lib\site-packages (from pandas) (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ead\desktop\luiz\projeto_final_manha\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ead\desktop\luiz\projeto_final_manha\.venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ead\desktop\luiz\projeto_final_manha\.venv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\ead\desktop\luiz\projeto_final_manha\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [4]:
! pip install pymysql

Requirement already satisfied: pymysql in c:\users\ead\desktop\luiz\projeto_final_manha\.venv\lib\site-packages (1.1.1)

In [5]:
import pandas as pd

In [6]:
from sqlalchemy import create_engine

In [7]:
import pymysql

In [8]:
# Biblioteca para converter e resolver problema do @
import urllib.parse

# Qual o usuário do banco e a senha?

user = 'root'
password = urllib.parse.quote_plus('senai@123')

# Qual o host e o banco?
host = 'localhost'
database = 'projetodiario1'

# Connection_string : string com TODAS as informações da conexõo
connection_string = f'mysql+pymysql://{user}:{password}@{host}/{database}'

# Criando a conexão
engine = create_engine(connection_string)

# Escrever uma consulta SQL
query_alunos = "SELECT * FROM aluno"
query_diario = "SELECT * FROM diariobordo"
query_avaliacao = "SELECT * FROM avaliacao"

# Criar um dataframe com a consulta SQL 
df_alunos = pd.read_sql(query_alunos,engine)
df_diario = pd.read_sql(query_diario,engine)
df_avaliacao = pd.read_sql(query_avaliacao,engine)

df_alunos

     id        ra      nome  tempoestudo  rendafamiliar
0     1  12345678      None            0            NaN
1     2  12345679      None            0            NaN
2     3  12345680      None            0            NaN
3     4  12345681      None            0            NaN
4     5  12345682      None            0            NaN
..  ...       ...       ...          ...            ...
68  179  12345746   Beatriz            4        6789.01
69  180  12345747      João            1        5678.90
70  181  12345748  Fernanda            5        1234.56
71  182  12345749     Lucas            2        3456.78
72  183  12345750    Amanda            3        7890.12

[73 rows x 5 columns]

### - Pandas (EDA - Análise Exploratória de Dados)
### - SciktLearn (Fundamentos de Inteligência Artificial)
### - NumPy (Matemática complexa com abstração)

## Salvando o DataFrame

- .csv
- .xlsx
- .json
- .sql
- .html
- .xml

In [9]:
csv_filename = "alunos.csv"
df_alunos.to_csv(csv_filename,index=False)

### crie uma nova celula que salve o dataframe no formato .json

In [10]:
json_filename = "aluno.json"
df_alunos.to_json(json_filename,index=False)

###### Auto formatação do arquivo (alt+shift+f)

### Um novo dataframe

In [11]:
df_alunos.columns

Index(['id', 'ra', 'nome', 'tempoestudo', 'rendafamiliar'], dtype='object')

In [12]:
df_tempo_renda = df_alunos[['tempoestudo','rendafamiliar']]
df_tempo_renda

    tempoestudo  rendafamiliar
0             0            NaN
1             0            NaN
2             0            NaN
3             0            NaN
4             0            NaN
..          ...            ...
68            4        6789.01
69            1        5678.90
70            5        1234.56
71            2        3456.78
72            3        7890.12

[73 rows x 2 columns]

## Exercicio: Como mostrar os registros do DataFrame usando fatiamento?

In [13]:
len(df_alunos)

73

In [14]:
df_alunos[25:30]

     id        ra   nome  tempoestudo  rendafamiliar
25   26  12345703   None            0            NaN
26  137  12345704  Maria            2        3210.45
27  138  12345705   João            4        2456.78
28  139  12345706  Luana            3        7890.12
29  140  12345707  Pedro            1        1234.56

# Crie uma serie apenas com a renda familiar

In [15]:
renda = df_alunos['rendafamiliar']
type(renda)

pandas.core.series.Series

In [16]:
renda

0         NaN
1         NaN
2         NaN
3         NaN
4         NaN
       ...
68    6789.01
69    5678.90
70    1234.56
71    3456.78
72    7890.12
Name: rendafamiliar, Length: 73, dtype: float64

# Funções basicas

## 1° Retorne as duas primeiras linhas de um Dataframe:

In [17]:
# usando fatiamento
inicio = df_alunos[0:2]
inicio

   id        ra  nome  tempoestudo  rendafamiliar
0   1  12345678  None            0            NaN
1   2  12345679  None            0            NaN

In [18]:
#usando metodo
df_alunos.head(2)

   id        ra  nome  tempoestudo  rendafamiliar
0   1  12345678  None            0            NaN
1   2  12345679  None            0            NaN

#### Buscando o registro usando 'iloc'

In [19]:
#usando iloc
df_alunos.iloc[0:2]

   id        ra  nome  tempoestudo  rendafamiliar
0   1  12345678  None            0            NaN
1   2  12345679  None            0            NaN

In [20]:
#buscar um registro especifico
df_alunos.iloc[40]

id                    151
ra               12345718
nome                Sofia
tempoestudo             5
rendafamiliar     4567.89
Name: 40, dtype: object

In [21]:
df_alunos.iloc[-2:]

     id        ra    nome  tempoestudo  rendafamiliar
71  182  12345749   Lucas            2        3456.78
72  183  12345750  Amanda            3        7890.12

## 2° Agora retorne as duas ultimas linhas da amostra

In [22]:
#usando metodo
df_alunos.tail(2)

     id        ra    nome  tempoestudo  rendafamiliar
71  182  12345749   Lucas            2        3456.78
72  183  12345750  Amanda            3        7890.12

In [23]:
#Usando fatiamento
final = df_alunos[71:73]
final

     id        ra    nome  tempoestudo  rendafamiliar
71  182  12345749   Lucas            2        3456.78
72  183  12345750  Amanda            3        7890.12

## 3° Retorne uma tupla com o numero de linhas e colunas

In [24]:
df_alunos.shape

(73, 5)

In [25]:
df_alunos.columns

Index(['id', 'ra', 'nome', 'tempoestudo', 'rendafamiliar'], dtype='object')

In [26]:
df_alunos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73 entries, 0 to 72
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             73 non-null     int64
 1   ra             73 non-null     object
 2   nome           47 non-null     object
 3   tempoestudo    73 non-null     int64
 4   rendafamiliar  47 non-null     float64
dtypes: float64(1), int64(2), object(2)
memory usage: 3.0+ KB

In [27]:
df_alunos.describe()

               id  tempoestudo  rendafamiliar
count   73.000000    73.000000      47.000000
mean   107.821918     1.917808    4728.408085
std     71.626218     1.823865    2302.940793
min      1.000000     0.000000    1234.560000
25%     19.000000     0.000000    2401.225000
50%    147.000000     2.000000    4567.890000
75%    165.000000     3.000000    6789.010000
max    183.000000     5.000000    7890.120000

## União

- Concat( )
- merge( )

## Crie um novo Dataframe da tabela diariobordo do MySQL

In [28]:
df_diario

   id             texto            datahora  fk_aluno_id
0   1  a aula foi legal 2024-08-01 09:16:00           13
1   2    Gostei da aula 2024-08-01 09:34:00           10
2   3         Maravilha 2024-08-01 09:37:00            3
3   4    aula muito boa 2024-08-01 09:53:00            5
4   5   ZZZZZZZZZZzzzzz 2024-08-01 09:37:00           20

## Crie um novo Dataframe da tabela avaliacao do MySQL

In [29]:
df_avaliacao

   id_pk  nota1  nota2  nota3  nota4  fk_aluno_id
0      1     20     18     15     22            1
1      2     23     19     20     21            2
2      3     17     16     14     20            3
3      4     25     24     22     23            4
4      5     19     18     20     21            5

### Passo para o merge
- Use o comando merge
- Crie uma variavel : pode ser resultado o nome.
- pd.merge(dataframe1,dataframe2,tipo_união,qual chave da esquerda, qual chave da direita)
- Qual o tipo de união: how='inner'
- inner significa que queremos um join interno, o que resulta em apenas as linhas que tem correspondência em ambos os DataFrames.

In [31]:
# realizar o join

resultado = pd.merge(df_diario,df_alunos,how='left',left_on='fk_aluno_id',right_on='id')
resultado

,id_x,texto,datahora,fk_aluno_id,id_y,ra,nome,tempoestudo,rendafamiliar
0,1,a aula foi legal,2024-08-01 09:16:00,13,13,12345690,None,0,NaN
1,2,Gostei da aula,2024-08-01 09:34:00,10,10,12345687,None,0,NaN
2,3,Maravilha,2024-08-01 09:37:00,3,3,12345680,None,0,NaN
3,4,aula muito boa,2024-08-01 09:53:00,5,5,12345682,None,0,NaN
4,5,ZZZZZZZZZZzzzzz,2024-08-01 09:37:00,20,20,12345697,None,0,NaN